src/main/resources/examples/xml/example.xml

<?xml version="1.0" ?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v3="http://www.portoseguro.com.br/corporativo/integration/DadosAtendimentoSocorristaIntegrationServiceABCS/V3_0/" xmlns:v31="http://www.portoseguro.com.br/corporativo/integration/AcionamentoPortoSocorroIntegrationServiceSCA/V3_0/" xmlns:v1="http://www.portoseguro.com.br/corporativo/integration/AcionamentoWebIntegrationServiceABCS/V1_0/" xmlns:v2="http://www.portoseguro.com.br/novoServico" xmlns:v11="http://www.portoseguro.com.br/pomar/business/AcionamentoPomarEBM/V1_0/" xmlns:v12="http://www.portoseguro.com.br/ebo/CarroReserva/V1_0" xmlns:v13="http://www.portoseguro.com.br/ebo/LojaLocadora/V1_0" xmlns:v14="http://www.portoseguro.com.br/ebo/Endereco/V1_0" xmlns:v15="http://www.portoseguro.com.br/ebo/Cidade/V1_0" xmlns:v16="http://www.portoseguro.com.br/ebo/Common/V1_0" xmlns:v17="http://www.portoseguro.com.br/ebo/Telefone/V1_0" xmlns:v18="http://www.portoseguro.com.br/ebo/Locadora/V1_0" xmlns:v19="http://www.portoseguro.com.br/ebo/VeiculoLoja/V1_0">
   <soapenv:Header/>
   <soapenv:Body>
      <v3:criarAlterarServicoRequest xmlns:v3='http://www.portoseguro.com.br/corporativo/integration/DadosAtendimentoSocorristaIntegrationServiceABCS/V3_0/' xmlns:v2="http://www.portoseguro.com.br/novoServico" xmlns:v31='http://www.portoseguro.com.br/corporativo/integration/AcionamentoPortoSocorroIntegrationServiceSCA/V3_0/' xmlns:v1='http://www.portoseguro.com.br/corporativo/integration/AcionamentoWebIntegrationServiceABCS/V1_0/' xmlns:v11='http://www.portoseguro.com.br/pomar/business/AcionamentoPomarEBM/V1_0/'>
  <v31:cargaLegado>
    <v1:servico>
      <v11:Ano_Modelo_Veiculo>2012-01-01T00:00:00Z</v11:Ano_Modelo_Veiculo>
      <v11:Codigo_Cor_Veiculo>1</v11:Codigo_Cor_Veiculo>
      <v11:LocalizacaoAtendimento>
        <v11:localizacaoAtendimento>
          <v11:tipo_Endereco>1</v11:tipo_Endereco>
          <v11:nome_Logradouro>Av. Bernardino de Campos</v11:nome_Logradouro>
          <v11:numero_Logradouro>327</v11:numero_Logradouro>
          <v11:sub_Bairro>Paraíso</v11:sub_Bairro>
          <v11:bairro>Paraíso</v11:bairro>
          <v11:cidade>São Paulo</v11:cidade>
          <v11:uf>SP</v11:uf>
        </v11:localizacaoAtendimento>
        <v11:localizacaoAtendimento>
          <v11:tipo_Endereco>2</v11:tipo_Endereco>
          <v11:nome_Logradouro>Av. Bernardino de Rosas</v11:nome_Logradouro>
          <v11:numero_Logradouro>327</v11:numero_Logradouro>
          <v11:sub_Bairro>Paraíso</v11:sub_Bairro>
          <v11:bairro>Paraíso</v11:bairro>
          <v11:cidade>São Paulo</v11:cidade>
          <v11:uf>SP</v11:uf>
        </v11:localizacaoAtendimento>
      </v11:LocalizacaoAtendimento>
    </v1:servico>
    <v2:servico><preco>14</preco></v2:servico>
    <limite_quilometragem>20</limite_quilometragem>
  </v31:cargaLegado>
</v3:criarAlterarServicoRequest>
   </soapenv:Body>
</soapenv:Envelope>